"""while ციკლის დავალებები:

Timer: დაწერეთ პროგრამა, რომელიც ითვლის 10-დან 1-მდე, დაბეჭდავს თითოეულ რიცხვს და შემდეგ დაბეჭდავს "დრო ამოიწურა".
რიცხვების ჯამი: დაწერეთ პროგრამა, რომელიც მომხმარებელს სთხოვს რიცხვებს განუწყვეტლივ, სანამ ისინი არ შეიყვანენ 0-ს.
შემდეგ დაბეჭდეთ ყველა შეყვანილი რიცხვის ჯამი.
პაროლის შემოწმება: დაწერეთ პროგრამა, რომელიც სთხოვს მომხმარებელს პაროლის შეყვანას. განაგრძეთ კითხვა, სანამ სწორი პაროლი
არ იქნება შეყვანილი. დავუშვათ, რომ სწორი პაროლი არის "12345678".
ლუწი რიცხვები: დაწერეთ პროგრამა, რომელიც ბეჭდავს ყველა ლუწ რიცხვს 0-დან 20-მდე while ციკლის გამოყენებით.
დადებითი რიცხვები: შექმენით პროგრამა, რომელიც სთხოვს მომხმარებელს უწყვეტად შეიყვანოს დადებითი რიცხვები,
სანამ ისინი უარყოფით რიცხვს არ შეიყვანენ. შემდეგ დაბეჭდეთ ყველა შეყვანილი დადებითი რიცხვის ჯამი."""
# 1



n = 10
while n > 0:
    print(n)
    n = n-1
print('1.დრო ამოიწურა')
# 2
m=1
sum=0
while m!=0:
    m=int(input('2.შეიყვანეთ რიცხვი'))
    print(m)
    sum=sum+m
print('ყველა რიცხვის ჯამია - ',sum)

# 3
password = '12345678'
UserPassword = ''
while password != UserPassword:
    UserPassword = input('3.enter a password')
print('Correct one!')
# 4
n=0
while n<21:
    print(n)
    n=n+2
# 5
m=1
sum=0
while m>0:
    m=int(input('4.შეიყვანეთ რიცხვი'))
    print(m)
    sum=sum+m
print('4.ყველა რიცხვის ჯამია - ',sum)


"""If statement დავალებები:

შეამოწმეთ ლუწია თუ კენტი: დაწერეთ პროგრამა, რომელიც მომხმარებელს სთხოვს რიცხვს და ბეჭდავს ლუწია თუ კენტი.
ტემპერატურის კლასიფიკაცია: შექმენით პროგრამა, რომელიც მომხმარებელს სთხოვს ტემპერატურას ცელსიუსში. შემდეგ დაბეჭდეთ ცხელი
(> 30°C), თბილი (20-30°C) ან ცივი (<20°C).
ასოების შეფასება: დაწერეთ პროგრამა, რომელიც სთხოვს მომხმარებელს გამოცდის ქულას. შემდეგ დაბეჭდეთ მათი ასოების შეფასება
შემდეგი სკალის მიხედვით:
A (90-100), B (80-89), C (70-79), D (60-69), F (< 60).
შეამოწმეთ გაყოფა: შექმენით პროგრამა, რომელიც მომხმარებელს სთხოვს რიცხვს. შემდეგ დაბეჭდეთ, იყოფა თუ არა 2-ზე, 3-ზე ან ორივეზე.
რიცხვების შედარება: დაწერეთ პროგრამა, რომელიც სთხოვს მომხმარებელს ორ რიცხვს და შეადარებს მათ."""

# 1
a = int(input('შეიყვანეთ რიცხვი'))
if a%2==0:
    print('ლუწია')
else:
    print('კენტია')
# 2
b = int(input('შეიყვანეთ რიცხვი'))
if b>30:
    print('ცხელი')
elif b>20:
    print('თბილი')
else:
    print('ცივი')
# 3
c = int(input('შეიყვანეთ რიცხვი'))
if 100>c>90:
    print('A')
elif 90>c>80:
    print('B')
elif 80>c>70:
    print('C')
elif 70>c>60:
    print('D')
else:
    if c>100:
        print('შეუძლებელი რიცხვია')
    elif c<0:
        print('შეუძლებელი რიცხვია')
    else:
        print('F')
# 4

d = int(input('შეიყვანეთ რიცხვი'))
if d%6==0:
    print('ეს რიცხვი იყოფა 2-ზე და 3-ზე')
elif d%3==0:
    print('ეს რიცხვი იყოფა 3-ზე')
elif d%2==0:
    print('ეს რიცხვი იყოფა 2-ზე ')

num1 = int(input("შეიყვანეთ თქვენთვის სასურველი რიცხვი"))
num2 = int(input("შეიყვანეთ თქვენთვის სასურველი რიცხვი"))
print(num1>num2)
print(num1<num2)
print(num1==num2)

"""Combined (გამოიყენეთ while loop და if statement):

რიცხვის გამოცნობა: დაწერეთ პროგრამა, რომელიც სთხოვს მომხმარებელს გამოიცნოს რიცხვი
(მაგ., 5, ეს რიცხვი თქვენ აირჩიეთ). განაგრძეთ კითხვა, სანამ არ გამოიცნობენ სწორად.

რიცხვების შემოწმება: შექმენით პროგრამა, რომელიც სთხოვს მომხმარებელს რიცხვს.
სანამ ეს რიცხვი არ იქნება ლუწი, შეეკითხეთ მომხმარებელს თავიდან.

რიცხვების კლასიფიკაცია: შექმენით პროგრამა, სადაც 50-იდან 100-ის ჩათვლით გამოიტანთ კენტ რიცხვებს.
ციკლის გარეთ შექმენით ჯამის ცვლადი, სადაც დაემატება ციკლის ის რიცხვები,
რომლებიც მეტია 75-ზე. ბოლოს დაპრინტეთ ამ ცვლადის მნიშვნელობა

რიცხვების შედარება: მომხმარებელს შეეკითხეთ რიცხვი. სანამ ის ნაკლები იქნება მასზე 20-ით დიდ რიცხვზე,
დაპრინტეთ ის და მასზე მოახდინეთ იტერაცია 1-ით.

სახელის გამოცნობა. შექმენით ცვლადი სადაც იქნება შენახული თქვენი სახელი.
მომხმარებელს შეეკითხეთ სახელი და სანამ თქვენსას არ შემოიტანს თავიდან შეეკითხეთ. """

#1
x = 5
usernum = int(input("შეიყვანეთ რიცხვი"))
while usernum != x:
    print("არასწორი რიცხვია")
print("სწორია")

#2
usernumber = int(input("შეიყვანეთ რიცხვი"))
while usernumber%2 == 0:
    print("კენტია")
print("ლუწია")

#3
for i in range(50,101,3):
    

