"""დავალება1) 0-იდან 20-ის ჩათვლით დაპრინტეთ ყველა მთელი რიცხვი.

დავალება2) 50-იდან 100-ის ჩათვლით არსებული ყველა რიცხვი დააჯამეთ for ციკლის გამოყენებით.
ეს ჯამი უნდა შეინახოს ცვლადში, ამიტომ ციკლის გარეთ შექმენით sum ცვლადი,
რომელსაც ციკლში მიემატება საიტერაციო ცვლადის მნიშვნელობა. საბოლოოდ დაპტინტეთ sum ცვლადის მნიშვნელობა.

დავალება3) -10-იდან 10-ის ჩათვლით დაატრიალეთ for ციკლი და იტერაცია მოახდინეთ 3-ით
(გაიხსენეთ step), დაპრინტეთ საიტერაციო ცვლადის მნიშვნელობა ყოველ ციკლის დატრიალებაზე."""

for i in range(21):
    print(i)

sum = 0
for b in range(50,101):
    sum = sum + b
print(sum)

for a in range(-10,11,3):
    print(a)