"""დაწერეთ ალგორითმი რომელიც დაბეჭდავს დადებითია,
უარყოფითი თუ ნულის ტოლი მომხმარებლის მიერ შემოტანილი რიცხვი.

დაწერეთ ალგორითმი რომელიც მომხმარებელს შეთავაზებს ორ ოპერაციას:
კილომეტრი - მილი, მილი - კილომეტრი. მომხმარებელმა უნდა აირჩიოს ერთ-ერთი მათგანი,
ხოლო შემდეგ შეეკითხეთ რიცხვითი მნიშვნელობა,
რომელზეც მოახდენთ მუშაობას და საბოლოოდ დაუბეჭდეთ უკვე გადაყვანილი მნიშვნელობა.
თუ მომხმარებელი სწორად არ აირჩევს ოპერაციას, დაბეჭდეთ "Wrong decision".

შექმენით რეგისტრაციის ალგორითმი. მომხმარებელს შეეკითხეთ სახელი, გვარი, ასაკი და მეილი,
საბოლოოდ კი ერთ წინადადებაში გამოიტანეთ მიღებული ინფორმაცია.

მომხმარებელს სამჯერ შეეკითხეთ რიცხვითი მნიშვნელობა და დაბეჭდეთ მათი საშუალო არითმეტიკული.

მომხმარებელს შეეკითხეთ 1-იდან 9-ის ჩათვლით რომელიმე რიცხვი.
შემდეგ გამოიყენეთ for ციკლი და გამოიტანეთ ამ რიცხვის ჯერადები 1-იდან 50-მდე დიაპაზონში.

მომხმარებელს შემოატანინეთ ორი რიცხვი. შემდეგ მათ შორის უმცირესი for ციკლში საწყის,
 ხოლო უდიდესი საბოლოო მნიშვნელობად გამოიყენეთ.
ციკლში იტერაცია მოახდინეთ ერთით და გამოიტანეთ საიტერაციო ცვლადის მესამე ხარისხი (კუბი).

მომხმარებელს შემოატანინეთ რიცხვი და დაბეჭდეთ მისი ციფრთა ჯამი.

დაწერეთ პროგრამა, რომელიც იღებს მომხმარებლისგან მთელ რიცხვს
და დაბეჭდავს მის გამრავლების ცხრილს 10-ის ჩათვლით. მაგ: x, x2, x3 ... x*10.

შექმენით კალკულატორი, სადაც გექნებათ ოთხი ოპერაცია: + - / და გამრავლება (ფიფქი არ იწერება).
მომხმარებელს შეეკითხებით ორ რიცხვს, შემდეგ სასურველ ოპერაციას და დაუბეჭდავთ გამოთვლილ მნიშვნელობას.

დაწერეთ პროგრამა, რომელიც იღებს სთრინგს,
შემდეგ მომხმარებელს ეკითხება თუ რამდენჯერ განმეორდეს და for ციკლის გამოყენებით დაბეჭდეთ ის.

დაწერეთ პროგრამა, რომელიც გამოთვლის სხეულის მასის ინდექსს (BMI), 
მომხმარებლისგან მიღებული წონის (კილოგრამებში) და სიმაღლის (მეტრებში) გათვალისწინებით.
მომხმარებელს შემოატანინეთ წელი და შეამოწმეთ ის ნაკიანი არის თუ არა.

დაწერეთ პროგრამა, რომელიც სთხოვს მომხმარებელს შეიყვანოს რიცხვი 1-დან 5-ის ჩათვლით.
თუ რიცხვი არის 1-ზე ნაკლები ან 5-ზე მეტი, დაბეჭდეთ "Invalid input". 
თუ რიცხვი 1-დან 5-ის ჩათვლითაა, დაბეჭდეთ "Valid input"."""

#1
a = int(input('შეიყვანეთ რიცხვი'))
if a==0:
    print('ნულია')
elif a>0:
    print('დადებითია')
else:
    print('უარყოფითია')

#2
value = input('M - miles, K - KM')
b = int(input('შეიყვანეთ რიცხვი'))
if value=='K':
    print(b*1,62)
elif value=='M':
    print(b*0,6)
else:
    print('Ur input is wrong')

#3
name = input('Name: ')
surname = input('Surname: ')
email = input('Email: ')
age = input('Age: ')
print('Hello',name,surname,'Ur email is ',email,'And ur age is',age)

#4
a = int(input('შეიყვანეთ რიცხვი 1'))
b = int(input('შეიყვანეთ რიცხვი 2'))
c = int(input('შეიყვანეთ რიცხვი 3'))
print((a+b+c)/3)

#5
a = int(input('შეიყვანეთ რიცხვი 1-9დე'))
if 9>=a>=1:
    for i in range(1,50):
        if i%a==0:
            print(i)
else:
    print('არასწორი რიცხვი შეიყვანეთ')

#6
c = int(input('შეიყვანეთ რიცხვი 1'))
d = int(input('შეიყვანეთ რიცხვი 2'))
for i in range(c,d):
    print(i)

#7
sum = 0
a = input('შემოიყვანეთ რიცხვი')
for i in a:
    sum=sum+ int(i)
print(sum)

#8
a = int(input('შეიყვანეთ რიცხვი'))
for i in range(1,11):
    print(a,i)

#9
a = int(input('შეიყვანეთ რიცხვი 1'))
b = int(input('შეიყვანეთ რიცხვი 2'))
c = input('შეიყვანეთ ოპერაცია +,-,/,')
if c=='+':
    print(a+b)
elif c=='-':
    print(a-b)
elif c=="/":
    print(a/b)
else:
    print(a*b)

#10
a = input('შეიყვანეთ წინადადება')
b = int(input('რამდენჯერ დავბეჭდო?'))
for i in range(b):
    print(a)

#11
kg = int(input('შეიყვანეთ წონა'))
m = int(input('შეიყვანეთ სიმაღლე'))
print(kg/(m))

#12
a = int(input('შეიყვანეთ წელი'))
if a%4==0:
    print('ნაკიანია')
else:
    print('არაა ნაკიანი')

#13
a = int(input('შეიყვანეთ რიცხვი'))
if 1<=a<=5:
    print('Valid input')
else:
    print('Invalid input')